# Taps
tap "mongodb/brew"
tap "supabase/tap"

# Command line tools
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "deno"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "httpd"
brew "hugo"
brew "ios-deploy"
brew "lazygit"
brew "libimobiledevice"
brew "make"
brew "mas"
brew "mono"
brew "neo4j"
brew "neovim"
brew "nvm"
brew "openssl@3"
brew "pandoc"
brew "pipx"
brew "pnpm"
brew "postgresql@14"
brew "postgresql@16"
brew "python-matplotlib"
brew "python-tk@3.12"
brew "python-tk@3.9"
brew "redis"
brew "ripgrep"
brew "ruby"
brew "stow"
brew "supabase/tap/supabase"
brew "tree"
brew "watchman"
brew "wxwidgets"
brew "xcodegen"
brew "yt-dlp"
brew "zoxide"

# Applications
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "anaconda"
cask "android-file-transfer"
cask "android-studio"
cask "arc"
cask "bambu-studio"
cask "brave-browser"
cask "bruno"
cask "curseforge"
cask "discord"
cask "docker"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "ghostty"
cask "gimp"
cask "godot-mono"
cask "iina"
cask "insomnia"
cask "iterm2"
cask "karabiner-elements"
cask "legcord"
cask "linearmouse"
cask "microsoft-word"
cask "multipatch"
cask "obsidian"
cask "ollama"
cask "pgadmin4"
cask "postman"
cask "pycharm"
cask "qbittorrent"
cask "raycast"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "zed"
cask "zen"
cask "zoom"
